Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: This means that the learning powers in lessons will focus on openness and feedback, before traditional teaching methods (lectures).
nn: Dette betyr mellomanna at lærekreftene i periodar skal fokusere på tilgjenge og tilbakemelding, framfor tradisjonell undervising (føredrag).

source: discuss C2 challenges both nationally and within NATO operations.
nn: drøfte K2-utfordringar nasjonalt og i NATO-operasjonar.

source: Beyond this, self-study under supervision will be the basis for a common methodological approach within the course.
nn: Utover dette, så skal sjølvstudium under rettleiing ligge til grunn som felles metodisk tilnærming i emnet.

source: Organisation and coordination
nn: Organisering og koordinering

source: In particular, the topics of Naval English and Naval Leadership will be integrated into the other topics.
nn: Særleg vil delemna sjømilitær engelsk og sjømilitært leiarskap bli trekt inn i dei andre delemna.

source: summarise a fundamental insight into the naval profession and ethical issues.
nn: oppsummere grunnleggande innsikt i sjømilitære fag- og yrkesetiske problemstillingar.

source: Academic methods, theory of knowledge and decision theory provides a basis for critical thinking, an understanding of the premises and frameworks for the staff programmes and the operational processes of planning and decision-making, in addition to a providing a basis for further education at the Master’s level.
nn: Vitskaplege metodar, kunnskapsteori og avgjersleteori gir eit grunnlag for kritisk tenking, ei forståing for premissa og rammene for stabsstudiane og dei operative plan- og avgjersleprosessane, samt eit grunnlag for å gå vidare på masterstudiane.

source: This course builds on the common course from the first semester and aims to provide the cadets with knowledge and skills in order to understand the naval profession and demonstrate understanding of naval issues.
nn: Emnet bygger på fellesemna i fyrste semester og har som føremål å tilføre kadettane kunnskapar og ferdigheitar for å kunne forstå den sjømilitære profesjon og utvise skjønn i sjømilitære problemstillingar.

source: discuss combat ability (capability), individually and complementary, limitations and possibilities.
nn: diskutere kampevne (kapabilitet), einskild og komplementært, avgrensingar og moglegheiter.

source: Written tasks and presentations must, for example, completed in English, and all training assignments and exercises will similarly be done in English within the subject of leadership.
nn: gjerast på engelsk, alle øvingsoppgåver og øvingar skal likeeins brukast inn i leiarskapsfaget og/eller Sjømakt og tryggleikleikstudier.

source: In course 5, the cadets will gain knowledge and skills that are the common building blocks in such exercise of judgment.
nn: I emne 5 skal kadettane bli tilført kunnskapar og ferdigheitar som utgjer felles byggjesteinar i slik utøving av skjønn.

source: This means that the teachers at times will focus on mentoring and feedback, more than traditional teaching methods (lectures).
nn: Dette betyr mellomanna at lærekreftene i periodar skal fokusere på tilgjenge og tilbakemelding, framfor tradisjonell undervising (føredrag).

source: explain the rationale for, and an understanding of, the military planning and decision-making process
nn: forklare rasjonale for og forstå militær plan- og avgjersleprosess

source: The download takes a while to process.
nn: Har du fleire spørsmål, kan du ta kontakt med oss.

source: The course will primarily be implemented on missions with the HNoMS Statsraad Lehmkuhl.
nn: Emnet vil i all hovudsak bli gjennomført på tokt med KNM Statsraad Lehmkuhl.

source: The teaching and development of individual and team-orientated leadership will provide the cadets with a personal, professional and ethical foundation for developing and exercising good naval leadership.
nn: Samla skal undervisinga og utviklinga av individuell- og teamorientert leiarskap gi kadetten eit menneskeleg, fagleg og yrkesetisk grunnlag for å utvikle og utøve godt sjømilitær leiarskap.

source: utilise probability, statistical methods and simple mathematical modelling as tools for the solution of practical and technical military problems.
nn: nyttegjere seg av sannsynsrekning, statistiske metodar og enkel matematisk modellering som støtte til løysing av praktiske og tekniske militære problem.

source: The cadets will be trained in English through written assignments and oral presentations within Naval Archimedes, and operational analyses will also be made in English.
nn: Kadettane skal trenast i engelsk ved at skriftelege arbeider og munnlege presentasjonar i Naval Archimedes og i operasjonsanalyse skal gjerast på engelsk.

source: In other words, a "happy ship" is also a ship where the individual completes his/her tasks alone or collaboratively without having to be guided and instructed constantly.
nn: Eit «happy ship» er med andre ord også eit skip kvar den einskilde løyser sine oppgåver aleine og i samarbeid, utan å måtte få føringar og instruksar.

source: explain the difference between qualitative and quantitative methods and their strengths and limitations
nn: forklare forskjellen på kvalitative og kvantitative metodar og deira styrker og avgrensingar

source: help create a learning environment that enables the unit/team to prepare and carry out maritime operations as a “happy ship”.
nn: bidra til å skape eit læringsmiljø som set avdelinga/teamet i stand til å førebu og gjennomføre maritime operasjonar som eit «happy ship».

source: The most important component of the course in promoting such an interdisciplinary approach is a practical problem-solving concept, EXER NAVAL ARCHIMEDES.
nn: Den viktigaste einskild komponenten i emnet for å fremje ei slik tverrfagleg tilnærming er eit praktisk problemløysingskonsept, EXER NAVAL ARCHIMEDES.

source: , and the teaching will make use of the fact that we are at sea together.
nn: Undervisninga skal difor nyttegjere det at ein er om bord.

source: This means that the individual cadet will both do his/her own work assignments and provide feedback to the other cadets under qualified supervision.
nn: Dette inneber at den einskilde kadett både skal laga eigne arbeider og gje tilbakemeldingar på dei andre kadettane under kvalifisert rettleiing.

source: exchange views and experiences in English with others within the subject area and through this, contribute to the development of effective forms of communication, and also improve on a shared consciousness.
nn: utveksle synspunkt og erfaringar på engelsk med andre innanfor fagområdet og gjennom dette bidra til utvikling effektive kommunikasjonsformar og betre felles medvit.

source: We will discuss the domain of the sea, its theory and history (naval power and naval warfare), as well as place this within cultural and international surroundings (international politics).
nn: Me vil løfte fram havdomenet, teori og historie (sjømakt og sjøkrig), samt setje dette inn i kulturelle og internasjonale omgjevnader (internasjonal politikk).

source: One in naval power (specific topic) and one in leadership (specific topic).
nn: Eit i sjømakt (spesifisert emne) og eit i leiarskap (spesifisert emne).

source: In addition, there will be a compendium in grammar, English Grammar.
nn: Kompendium med tekster og terminologi i sjømilitær og maritim engelsk

source: master clear and correct English pronunciation, as well as be able to read and understand relevant English literature in the naval and maritime field.
nn: mestre tydeleg og korrekt engelsk uttale, samt kunne lese og forstå relevant engelskspråkleg sjømilitær og maritim faglitteratur.

source: The cadets will also expand their competence and skills in naval English, presentation techniques and academic writing.
nn: Kadettane skal også utvide sin kompetanse og sine ferdigheitar i sjømilitær engelsk, presentasjonsteknikk og akademisk skriving.

source: The cadets will be trained in English through multiple written assignments and oral presentations within Naval Archimedes, and operational analyses will also be made in English.
nn: Kadettane skal trenast i engelsk ved at mange skriftelege arbeider og munnlege presentasjonar i Naval Archimedes og i operasjonsanalyse skal gjerast på engelsk.

source: This course builds on the common course from the first semester and aims to provide the cadets with knowledge and skills in order to understand the naval profession and demonstrate discretion in naval issues.
nn: Emnet bygger på fellesemna i fyrste semester og har som føremål å tilføre kadettane kunnskapar og ferdigheitar for å kunne forstå den sjømilitære profesjon og utvise skjønn i sjømilitære problemstillingar.

source: We will discuss the domain of the sea, its theory and history (naval power and naval warfare), as well as place this within its cultural and international environment (international politics).
nn: Me vil løfte fram havdomenet, teori og historie (sjømakt og sjøkrig), samt setje dette inn i kulturelle og internasjonale omgjevnader (internasjonal politikk).

source: In course 5, the cadets will gain knowledge and skills that are the common building blocks in the development of good judgement..
nn: I emne 5 skal kadettane bli tilført kunnskapar og ferdigheitar som utgjer felles byggjesteinar i slik utøving av skjønn.

source: talk about the Russian A2/AD strategy and the Bastion fortification.
nn: greie ut om russisk A2/AD og Bastionforsvaret.

source: Naval English (NE)
nn: Sjømilitær engelsk (SE)

source: Therefore, the teaching will ensure that the cadets are on board.
nn: Undervisninga skal difor nyttegjere det at ein er om bord.
